{
  "algorithm": "A step-by-step procedure for solving a problem or completing a task using a computer.",
  "api": "Application Programming Interface; a set of rules and protocols for building software applications.",
  "array": "A collection of elements of the same type stored in contiguous memory locations.",
  "bandwidth": "The maximum rate of data transfer across a given path.",
  "binary": "A number system that uses only two digits, 0 and 1.",
  "blockchain": "A distributed ledger technology that records transactions across multiple computers.",
  "bool": "A data type that can hold only two values: true or false.",
  "bootstrap": "The process of loading a program or system that enables itself to execute.",
  "bug": "An error or flaw in a software program that causes incorrect behavior.",
  "cache": "A hardware or software component that stores data for faster future access.",
  "cloud": "Internet-based computing services including storage, processing, and applications.",
  "compiler": "A program that converts source code written in a programming language into executable code.",
  "cpu": "Central Processing Unit; the primary component that executes instructions in a computer.",
  "cuda": "A parallel computing platform and application programming interface by NVIDIA.",
  "database": "An organized collection of structured data stored and accessed electronically.",
  "debug": "The process of identifying and removing errors from software code.",
  "deployment": "The process of releasing and implementing software into a production environment.",
  "docker": "A containerization platform that packages applications and their dependencies.",
  "encryption": "The process of converting information into code to prevent unauthorized access.",
  "framework": "A reusable set of libraries and tools for building applications more efficiently.",
  "frontend": "The user-facing part of a software application or website.",
  "function": "A reusable block of code that performs a specific task.",
  "git": "A distributed version control system for tracking changes in source code.",
  "gpu": "Graphics Processing Unit; a specialized processor for parallel processing tasks.",
  "gui": "Graphical User Interface; a visual way for users to interact with a computer.",
  "hash": "A function that converts input data into a fixed-size string of characters.",
  "heap": "A region of memory used for dynamic allocation of data structures.",
  "html": "HyperText Markup Language; the standard markup language for creating web pages.",
  "http": "HyperText Transfer Protocol; the protocol for transmitting data over the internet.",
  "ide": "Integrated Development Environment; a software tool for writing and testing code.",
  "inheritance": "A mechanism in object-oriented programming where a class inherits from another class.",
  "ip": "Internet Protocol; a set of rules for routing and addressing packets on the internet.",
  "javascript": "A versatile programming language primarily used for web development.",
  "json": "JavaScript Object Notation; a lightweight format for data interchange.",
  "kernel": "The core component of an operating system that manages system resources.",
  "lambda": "An anonymous function or function without a name, often used in functional programming.",
  "latency": "The delay between a request and a response in a system.",
  "library": "A collection of pre-written code and functions that can be reused.",
  "linux": "A free and open-source operating system kernel.",
  "loop": "A control structure that repeats a block of code multiple times.",
  "machine learning": "A subset of artificial intelligence that enables systems to learn from data.",
  "memory": "Hardware that stores data and instructions for the CPU to access.",
  "middleware": "Software that connects different applications or components in a system.",
  "node": "A point in a network or a single computer in a distributed system.",
  "npm": "Node Package Manager; a package manager for JavaScript and Node.js.",
  "null": "A value indicating the absence of any object or data.",
  "object": "An instance of a class that contains data and methods.",
  "optimization": "The process of improving code efficiency and performance.",
  "packet": "A unit of data transmitted over a network.",
  "palindrome": "A word, phrase, or sequence that reads the same forwards and backwards.",
  "parser": "A program that analyzes and interprets code or data format.",
  "permission": "Access rights assigned to users or processes for files and resources.",
  "pointer": "A variable that stores the memory address of another variable.",
  "polymorphism": "The ability of objects to take on multiple forms in object-oriented programming.",
  "protocol": "A set of rules governing the exchange of data over a network.",
  "python": "A high-level, general-purpose programming language known for readability.",
  "queue": "A data structure that follows the First-In-First-Out principle.",
  "recursion": "A programming technique where a function calls itself to solve a problem.",
  "regex": "Regular Expression; a pattern used for searching and matching strings.",
  "repository": "A central location where code, documentation, and files are stored.",
  "request": "A message sent from a client to a server to perform an action.",
  "response": "A message sent from a server back to a client.",
  "rest": "Representational State Transfer; an architectural style for web services.",
  "runtime": "The period during which a program is executing.",
  "script": "A sequence of commands written in a programming language that executes in order.",
  "server": "A computer that provides data, services, or functionality to other computers.",
  "socket": "An endpoint for network communication between two machines.",
  "sql": "Structured Query Language; a language for managing databases.",
  "stack": "A data structure that follows the Last-In-First-Out principle.",
  "string": "A sequence of characters used to represent text in programming.",
  "struct": "A composite data type that groups related variables together.",
  "syntax": "The set of rules that defines valid statements in a programming language.",
  "terminal": "A command-line interface for interacting with a computer system.",
  "thread": "A lightweight unit of execution within a process.",
  "token": "A piece of information that represents something of interest.",
  "typescript": "A superset of JavaScript that adds static typing capabilities.",
  "udp": "User Datagram Protocol; a connectionless internet communication protocol.",
  "ui": "User Interface; the visual and interactive elements of a software application.",
  "variable": "A named storage location that holds a value which can change.",
  "vector": "An array-like data structure that can dynamically resize.",
  "version control": "A system that tracks and manages changes to code over time.",
  "virtual": "Something that exists or is perceived to exist, but is not physical.",
  "virtualenv": "A tool for creating isolated Python environments.",
  "vm": "Virtual Machine; a software emulation of a physical computer.",
  "webpack": "A module bundler for JavaScript applications.",
  "xml": "Extensible Markup Language; a markup language for storing structured data.",
  "authentication": "The process of verifying the identity of a user or system.",
  "authorization": "The process of granting or denying access to resources after authentication.",
  "backend": "The server-side part of an application that handles logic, databases, and APIs.",
  "bit": "The smallest unit of data in computing, represented as 0 or 1.",
  "byte": "A unit of digital information consisting of 8 bits.",
  "cdn": "Content Delivery Network; a distributed network of servers that delivers content faster to users.",
  "cybersecurity": "The practice of protecting systems, networks, and data from digital attacks.",
  "devops": "A set of practices that combines software development and IT operations.",
  "firmware": "Permanent software programmed into hardware devices.",
  "firewall": "A security system that monitors and controls incoming and outgoing network traffic.",
  "open source": "Software whose source code is freely available for modification and distribution.",
  "scalability": "The ability of a system to handle increasing amounts of work or users.",
  "testing": "The process of evaluating software to ensure it works as expected.",
  "url": "Uniform Resource Locator; the address used to access resources on the internet."

}